/*
*********************************************************************************
*
*版权：黄凯
*
*********************************************************************************
*
*创建人：黄凯
*创建时间：2015.05.06
*
*********************************************************************************
*
*功能描述：用于存储所有宏定义
*
*********************************************************************************
*
*
*
*********************************************************************************
*/

#ifndef _DEFINE_H
#define _DEFINE_H

/**
* 数量宏定义
*
*/
#define FINS_FRAME_COUNT			10
#define CMD_FINS_0101				101
#define CMD_FINS_0102				102
#define FINS_MAX_CH					900
#define PLCDATA_ERROR				-5
#define OMRON_NA					1E+308
/**
* 字符定义
*
*/
#define	KOUMOKU_AI			1L		
#define	KOUMOKU_AO			2L
#define	KOUMOKU_DI			8L		
#define	KOUMOKU_DO			9L      

/**
* 命名空间宏定义
*
*/
#define USING_OMRAN_NAMESPACE	using namespace Omron;

#endif //_DEFINE_H